Revit 2027 API
Wire.InsertVertex Method
 Inserts a new vertex before the specified index.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void InsertVertex(
	int index,
	XYZ vertexPoint
)
Public Sub InsertVertex (
	index As Integer,
	vertexPoint As XYZ
)
public:
void InsertVertex(
	int index,
	XYZ^ vertexPoint
)
member InsertVertex :
        index : int *
        vertexPoint : XYZ -> unit
Parameters
index Int32
 The index of the vertex to come after this new vertex. Should be between 0 and NumberOfVertices.
vertexPoint XYZ
 The point of the new vertex.
Exceptions
Exception | Condition
ArgumentException |  The index should be between 0 and the number of vertices of the wire. -or- The vertex point cannot be added to the wire because there is already a vertex at this position on the view plane (within tolerance).
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Can't insert the vertex before the start vertex if the start point connects to one element.
Remarks
 To add a new vertex to the end of the wire, use AppendVertex(XYZ).
See Also
Reference
Wire Class
Autodesk.Revit.DB.Electrical Namespace